---
kind: method
id: M:Autodesk.Revit.DB.ModelCurveArray.GetEnumerator
source: html/4a2e9853-2ca9-ee32-748b-47c303c6f73c.htm
---
# Autodesk.Revit.DB.ModelCurveArray.GetEnumerator Method

Retrieve a forward moving iterator to the array.

## Syntax (C#)
```csharp
public virtual IEnumerator GetEnumerator()
```

## Returns
Returns a forward moving iterator to the array.